# Intro to Pandas
by Ryan Orsinger

## Module 2: Introducing DataFrames

### Pandas DataFrames Basics - Part 1
- How to make pandas DataFrames from other Python collections
- Learning about your dataframe's properties and information
- Selecting a single column
- Adding new columns to a DataFrame
- Renaming columns
- Descriptive stats on the columns

In [1]:
import pandas as pd

In [2]:
# Creating a dataframe from a list of dictionaries
basket = [
    {"item": "mango", "quantity": 4, "price": 2.99},
    {"item": "bread", "quantity": 2, "price": 3.25},
    {"item": "juice", "quantity": 1, "price": 5.90},
    {"item": "orange", "quantity": 3, "price": 2.99},
    {"item": "lime", "quantity": 3, "price": 0.3},
]
basket

[{'item': 'mango', 'quantity': 4, 'price': 2.99},
 {'item': 'bread', 'quantity': 2, 'price': 3.25},
 {'item': 'juice', 'quantity': 1, 'price': 5.9},
 {'item': 'orange', 'quantity': 3, 'price': 2.99},
 {'item': 'lime', 'quantity': 3, 'price': 0.3}]

In [3]:
# With dataframes, our columns are our variables or features
# Each row represents a unique observation (usually)
df = pd.DataFrame(basket)
df

     item  quantity  price
0   mango         4   2.99
1   bread         2   3.25
2   juice         1   5.90
3  orange         3   2.99
4    lime         3   0.30

In [4]:
# Creating a dataframe from a dictionary of lists
basket = {
    "item": ["mango", "bread", "juice", "orange", "lime"],
    "quantity": [4, 2, 1, 3, 3],
    "price": [2.99, 3.25, 5.90, 2.99, 0.30]
}
basket

{'item': ['mango', 'bread', 'juice', 'orange', 'lime'],
 'quantity': [4, 2, 1, 3, 3],
 'price': [2.99, 3.25, 5.9, 2.99, 0.3]}

In [5]:
pd.DataFrame(basket)

     item  quantity  price
0   mango         4   2.99
1   bread         2   3.25
2   juice         1   5.90
3  orange         3   2.99
4    lime         3   0.30

In [6]:
# Creating a dataframe from a list of lists
example = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

column_names = ["variable_a", "variable_b", "variable_c"]
row_names = ["observation_1", "observation_2", "observation_3"]

pd.DataFrame(example, columns=column_names, index=row_names)

               variable_a  variable_b  variable_c
observation_1           1           2           3
observation_2           4           5           6
observation_3           7           8           9

In [7]:
# Creating an empty dataframe
df = pd.DataFrame()

# Adding columns to a dataframe
# Any list-like data type can become a column
df["item"] = pd.Series(["Mango", "Bread", "Juice", "Orange", "Lime"]) #pandas series
df["quantity"] = [2, 2, 1, 3, 3] # list 
df["price"] = (2.99, 3.25, 5.90, 2.99, 0.30) # tuple
df

     item  quantity  price
0   Mango         2   2.99
1   Bread         2   3.25
2   Juice         1   5.90
3  Orange         3   2.99
4    Lime         3   0.30

In [8]:
# .shape returns rows, columns
df.shape

(5, 3)

In [9]:
# Returns the rows
df.shape[0]

5

In [10]:
# Returns the number of columns
df.shape[1]

3

In [11]:
# len returns number of rows
len(df)

5

In [12]:
# size returns rows * columns
df.size
# 5 * 3 = 15

15

In [13]:
# Adding new columns to the dataframe
df["subtotal"] = df["quantity"] * df["price"]
df

     item  quantity  price  subtotal
0   Mango         2   2.99      5.98
1   Bread         2   3.25      6.50
2   Juice         1   5.90      5.90
3  Orange         3   2.99      8.97
4    Lime         3   0.30      0.90

In [14]:
# set_index can overwrite the default index
df.set_index("item", inplace=True)
df

        quantity  price  subtotal
item
Mango          2   2.99      5.98
Bread          2   3.25      6.50
Juice          1   5.90      5.90
Orange         3   2.99      8.97
Lime           3   0.30      0.90

In [15]:
# Accessing the index values
df.index

Index(['Mango', 'Bread', 'Juice', 'Orange', 'Lime'], dtype='object', name='item')

In [16]:
# We can also overwrite the index with a Series of equal length
df.index = df.index.str.lower()
df

        quantity  price  subtotal
item
mango          2   2.99      5.98
bread          2   3.25      6.50
juice          1   5.90      5.90
orange         3   2.99      8.97
lime           3   0.30      0.90

In [17]:
# Accessing all the columns
df.columns

Index(['quantity', 'price', 'subtotal'], dtype='object')

In [18]:
# Another example of creating a new column
df["tax"] = 0.07
df

        quantity  price  subtotal   tax
item
mango          2   2.99      5.98  0.07
bread          2   3.25      6.50  0.07
juice          1   5.90      5.90  0.07
orange         3   2.99      8.97  0.07
lime           3   0.30      0.90  0.07

In [ ]:
# The "total cost" column does not exist, but this bracket syntax creates it.
df["total cost"] = df["subtotal"] + (df["subtotal"] * df["tax"])
df

In [ ]:
# Dot syntax also allows for calling an existing column
# Using .column syntax only works if the column exists already, has no spaces, and is not a dataframe method already
df.price

In [ ]:
df.subtotal

In [ ]:
# .dtypes outputs the datatypes of all columns in the dataframe
df.dtypes

In [ ]:
# .info returns datatype and non-null count
df.info()

In [ ]:
df.price.describe()
# 25% 1st quarter
# 75% 3rd querter
# 50% median
# std = standart deviation

In [ ]:
df.price

In [ ]:
# Show descriptive stats for numeric columns
df.describe()

In [ ]:
# A column in a dataframe is a series
type(df.quantity)

In [ ]:
# .value_counts returns a series
df.quantity.value_counts()

In [ ]:
# Aggregate functions can run on all the numeric values in the dataframe
df.mean()

In [ ]:
# Obtain the median of all numeric columns
df.median()

In [ ]:
# Standard deviation of all the numeric columns
df.std()

In [ ]:
# The square bracket syntax can be used to access column names with spaces
# Same with column names that are methods on the dataframe object
# Recommend avoiding column names with spaces, removing spaces when you encounter them
# Recommend avoiding naming columns after dataframe method
df["shape"] = ["round", "loaf", "jug", "round", "round"]
df

In [ ]:
# Remember that the .shape attribute shows # rows, #columns
df.shape

In [ ]:
# The bracket quote syntax returns the column
df["shape"]

In [ ]:
# Naming columns the same as built-in dataframe methods and spaces in column names are not helpful
# .rename allows for renaming columns in a dataframe using a dictionary
df.rename(columns={"shape": "item_shape", "total cost": "total"}, inplace=True)
df

## Exercises
- Assign dataframe named `df` out of the following list of dictionaries.
```
items = [
    {"item name": "USB cable", "price": "$10.99", "type": "USB C to USB C"},
    {"item name": "USB cable", "price": "$10.99", "type": "USB A to USB C"},
    {"item name": "Batteries", "price": "$9.99", "type": "AA"},
    {"item name": "Batteries", "price": "$8.99", "type": "AAA"},
    {"item name": "Mouse", "price": "$12.99", "type": "Wireless USB"},
]
```
- Rename the `item name` column to `item_name`
- Add a column named `units_sold` to this dataframe and assign the values `[41, 113, 54, 35, 22]`
- Convert the price column into a float (hint: remove non-numeric characters before attempting to convert the data type to a float)
- Create a new column named `total_revenue` that holds the `price` column times the `units_sold` column
- Round the `total_revenue` column values to the nearest whole number. (hint: search or consult the pandas documentation

In [63]:
import pandas as pd

In [64]:
# Assign dataframe named `df` out of the following list of dictionaries
items = [
    {"item name": "USB cable", "price": "$10.99", "type": "USB C to USB C"},
    {"item name": "USB cable", "price": "$10.99", "type": "USB A to USB C"},
    {"item name": "Batteries", "price": "$9.99", "type": "AA"},
    {"item name": "Batteries", "price": "$8.99", "type": "AAA"},
    {"item name": "Mouse", "price": "$12.99", "type": "Wireless USB"},
]

df = pd.DataFrame(items)

In [65]:
# Rename the item name column to item_name
df.rename(columns = {"item name": "item_name"}, inplace = True)
df

   item_name   price            type
0  USB cable  $10.99  USB C to USB C
1  USB cable  $10.99  USB A to USB C
2  Batteries   $9.99              AA
3  Batteries   $8.99             AAA
4      Mouse  $12.99    Wireless USB

In [66]:
# Add a column named units_sold to this dataframe and assign the values [41, 113, 54, 35, 22]
df["units_sold"] = [41, 113, 54, 35, 22]
df

   item_name   price            type  units_sold
0  USB cable  $10.99  USB C to USB C          41
1  USB cable  $10.99  USB A to USB C         113
2  Batteries   $9.99              AA          54
3  Batteries   $8.99             AAA          35
4      Mouse  $12.99    Wireless USB          22

In [71]:
# Convert the price column into a float data type
df["price"] = df["price"].str.replace("$","")
df["price"] = df["price"].astype("float")

In [72]:
# Create a new column named "total_revenue" that holds the `price` column times the `units_sold` column
df["total_revenue"] = df["price"] * df["units_sold"]
df

   item_name  price            type  units_sold  total_revenue
0  USB cable  10.99  USB C to USB C          41         450.59
1  USB cable  10.99  USB A to USB C         113        1241.87
2  Batteries   9.99              AA          54         539.46
3  Batteries   8.99             AAA          35         314.65
4      Mouse  12.99    Wireless USB          22         285.78

0    10.9910.9910.9910.9910.9910.9910.9910.9910.991...
1    10.9910.9910.9910.9910.9910.9910.9910.9910.991...
2    9.999.999.999.999.999.999.999.999.999.999.999....
3    8.998.998.998.998.998.998.998.998.998.998.998....
4    12.9912.9912.9912.9912.9912.9912.9912.9912.991...
Name: total_revenue, dtype: object

In [74]:
# Round the total_revenue column values to the nearest whole number.
df["total_revenue"] = df["total_revenue"].round()
df

   item_name  price            type  units_sold  total_revenue
0  USB cable  10.99  USB C to USB C          41          451.0
1  USB cable  10.99  USB A to USB C         113         1242.0
2  Batteries   9.99              AA          54          539.0
3  Batteries   8.99             AAA          35          315.0
4      Mouse  12.99    Wireless USB          22          286.0

In [75]:
# export file in csv
df.to_csv("profit_data.csv")

In [76]:
# export file in excel
df.to_excel("profit_data.xlsx")

ModuleNotFoundError: No module named 'openpyxl'